imbeastbro272/Fin-Tracker/ESP32_SmartLight_Manual_Time.ino
/*
 * ESP32 Smart Light with Embedded Machine Learning
 * ==================================================
 * Compatible with ESP32 Arduino Core v2.x AND v3.x
 *
 * Features:
 * - Real-time brightness prediction using Decision Tree
 * - Manual adjustment via potentiometer (additive offset)
 * - Online learning: Retrains model based on user adjustments
 * - Automatic data collection and periodic model updates
 * - MANUAL TIME INPUT via serial monitor (hh:mm:ss format)
 *
 * Hardware:
 * - ESP32 DevKit
 * - LDR (Light Dependent Resistor) for ambient light sensing
 * - PIR Motion Sensor
 * - Potentiometer (10K) for manual adjustment
 * - LED strip or bulb (PWM controlled)
 * - RTC Module (DS3231) OPTIONAL
 *
 * Pin Configuration:
 * - LDR:           GPIO34 (ADC1_CH6)
 * - Motion Sensor: GPIO27
 * - Potentiometer: GPIO33 (ADC1_CH5)
 * - LED PWM:       GPIO2  (built-in LED on most boards)
 *
 * Required Libraries (install via Arduino Library Manager):
 * - ArduinoJson  (v6.21 or v7.x by Benoit Blanchon)
 */

#include <Arduino.h>
#include <ArduinoJson.h>
#include <SPIFFS.h>
#include <math.h>

// ============================================================================
// PIN DEFINITIONS
// ============================================================================
#define LDR_PIN          34   // Analog input for LDR
#define MOTION_PIN       27   // Digital input for PIR sensor
#define POT_PIN          33   // Analog input for potentiometer
#define LED_PWM_PIN      2    // PWM output for LED control (built-in LED)
#define PWM_FREQ         5000 // PWM frequency (Hz)
#define PWM_RESOLUTION   8    // 8-bit resolution (0-255)

// On older ESP32 Core (v2.x), we still use channels.
// On v3.x, channel parameter is ignored by our wrapper.
#define LED_CHANNEL      0

// ============================================================================
// COMPATIBILITY: ESP32 Arduino Core v2.x vs v3.x LEDC API
// ============================================================================
void pwmSetup(uint8_t pin, uint8_t channel, uint32_t freq, uint8_t resolution) {
#if defined(ESP_ARDUINO_VERSION_MAJOR) && (ESP_ARDUINO_VERSION_MAJOR >= 3)
    ledcAttach(pin, freq, resolution);
#else
    ledcSetup(channel, freq, resolution);
    ledcAttachPin(pin, channel);
#endif
}

void pwmWrite(uint8_t pin, uint8_t channel, uint32_t value) {
#if defined(ESP_ARDUINO_VERSION_MAJOR) && (ESP_ARDUINO_VERSION_MAJOR >= 3)
    ledcWrite(pin, value);
#else
    ledcWrite(channel, value);
#endif
}

// ============================================================================
// CONFIGURATION
// ============================================================================
#define MAX_LUX                50000.0  // Will be loaded from preprocessing.json
#define LEARNING_SAMPLES       50       // Retrain after this many samples
#define SAMPLE_INTERVAL        1000     // Sample every 1 second (ms)
#define ADJUSTMENT_THRESHOLD   5.0      // Min adjustment CHANGE to trigger learning (%)

// ============================================================================
// GLOBAL VARIABLES
// ============================================================================
unsigned long bootMillis = 0;

// Manual time variables
int manualHour = 12;
int manualMinute = 0;
int manualSecond = 0;
unsigned long lastTimeUpdate = 0;

// Model parameters
float maxLux = MAX_LUX;

// Decision tree (loaded from JSON). 16KB capacity should fit most trees.
StaticJsonDocument<16384> treeDoc;
JsonObject treeRoot;

// Online learning buffer
struct DataSample {
    float lux_norm;
    int   motion_detected;
    float hour_sin;
    float hour_cos;
    int   time_of_day_enc;
    float effective_need;
    float target_brightness;
};

#define MAX_SAMPLES 200
DataSample learningBuffer[MAX_SAMPLES];
int sampleCount = 0;

// Runtime state
unsigned long lastSampleTime = 0;
float lastDTPrediction = 0.0;
float lastPotAdjustment = 0.0;
float previousPotAdjustment = 0.0;
float currentBrightness = 0.0;
float serialAdjustment = 0.0;
bool useSerialAdjustment = false;

// ============================================================================
// HELPER FUNCTIONS
// ============================================================================
void printSeparator(char ch, int count) {
    for (int i = 0; i < count; i++) Serial.print(ch);
    Serial.println();
}

// ============================================================================
// FORWARD DECLARATIONS
// ============================================================================
bool   loadModel();
void   loadLearningData();
void   saveLearningData();
void   retrainModel();
float  readLux();
float  readPotAdjustment();
void   handleSerialInput();
void   printHelp();
String getTimeOfDay(int hour);
int    getTimeEncoding(const String& timeOfDay);
void   setLEDBrightness(float percent);
float  predictBrightness(float lux_norm, int motion, float hour_sin,
                         float hour_cos, int time_enc, float effective_need);
void   updateManualTime();
void   getCurrentTime(int& hour, int& minute, int& second);

// ============================================================================
// SETUP
// ============================================================================
void setup() {
    Serial.begin(115200);
    delay(1000);
    bootMillis = millis();
    lastTimeUpdate = millis();

    Serial.println();
    printSeparator('=', 80);
    Serial.println("ESP32 SMART LIGHT WITH EMBEDDED ML - MANUAL TIME MODE");
    printSeparator('=', 80);

    // Initialize pins
    pinMode(MOTION_PIN, INPUT);
    pinMode(LDR_PIN, INPUT);
    pinMode(POT_PIN, INPUT);

    // Setup PWM for LED
    pwmSetup(LED_PWM_PIN, LED_CHANNEL, PWM_FREQ, PWM_RESOLUTION);
    pwmWrite(LED_PWM_PIN, LED_CHANNEL, 0);

    Serial.println();
    Serial.println("[1] Initializing Hardware...");

    // Initialize SPIFFS
    if (!SPIFFS.begin(true)) {
        Serial.println("  X SPIFFS initialization failed!");
        return;
    }
    Serial.println("  + SPIFFS initialized");

    // Load model and preprocessing parameters
    Serial.println();
    Serial.println("[2] Loading ML Model...");
    if (!loadModel()) {
        Serial.println("  X Failed to load model. Running with fallback rules.");
    }

