imbeastbro272/Fin-Tracker/ESP32_SmartLight_Manual_Time.ino
    // Load existing training data
    loadLearningData();

    Serial.println();
    Serial.println("[3] System Ready!");
    Serial.println("  - Automatic brightness control: ENABLED");
    Serial.println("  - Manual adjustment: ENABLED (potentiometer + serial)");
    Serial.println("  - Online learning: ENABLED");
    Serial.println("  - Time mode: MANUAL (default 12:00:00)");
    Serial.println();
    printHelp();
    printSeparator('=', 80);
    Serial.println();
}

// ============================================================================
// TIME MANAGEMENT
// ============================================================================
void updateManualTime() {
    unsigned long currentMillis = millis();
    unsigned long elapsed = currentMillis - lastTimeUpdate;
    
    if (elapsed >= 1000) {
        int secondsPassed = elapsed / 1000;
        lastTimeUpdate = currentMillis;
        
        manualSecond += secondsPassed;
        
        while (manualSecond >= 60) {
            manualSecond -= 60;
            manualMinute++;
        }
        
        while (manualMinute >= 60) {
            manualMinute -= 60;
            manualHour++;
        }
        
        while (manualHour >= 24) {
            manualHour -= 24;
        }
    }
}

void getCurrentTime(int& hour, int& minute, int& second) {
    updateManualTime();
    hour = manualHour;
    minute = manualMinute;
    second = manualSecond;
}

// ============================================================================
// SERIAL INPUT HANDLER
// ============================================================================
void handleSerialInput() {
    String input = Serial.readStringUntil('\n');
    input.trim();
    
    if (input.length() == 0) return;
    
    // Check for time format (hh:mm:ss)
    if (input.indexOf(':') >= 0) {
        int firstColon = input.indexOf(':');
        int secondColon = input.indexOf(':', firstColon + 1);
        
        if (firstColon > 0 && secondColon > firstColon) {
            String hourStr = input.substring(0, firstColon);
            String minuteStr = input.substring(firstColon + 1, secondColon);
            String secondStr = input.substring(secondColon + 1);
            
            int h = hourStr.toInt();
            int m = minuteStr.toInt();
            int s = secondStr.toInt();
            
            if (h >= 0 && h < 24 && m >= 0 && m < 60 && s >= 0 && s < 60) {
                manualHour = h;
                manualMinute = m;
                manualSecond = s;
                lastTimeUpdate = millis();
                Serial.printf("Time set to: %02d:%02d:%02d\n", h, m, s);
                return;
            } else {
                Serial.println("ERROR: Invalid time. Use 00-23 for hours, 00-59 for minutes/seconds");
                return;
            }
        }
    }
    
    // Convert to lowercase for command processing
    String inputLower = input;
    inputLower.toLowerCase();
    
    // Check for numeric input (-50 to +50)
    if (input.startsWith("+") || input.startsWith("-") || isdigit(input.charAt(0))) {
        float value = input.toFloat();
        if (value >= -50.0 && value <= 50.0) {
            serialAdjustment = value;
            useSerialAdjustment = true;
            Serial.printf("Manual adjustment set to: %+.1f%% (via serial)\n", serialAdjustment);
            Serial.println("This will be added to DT prediction.");
        } else {
            Serial.println("ERROR: Value must be between -50 and +50");
        }
    }
    // Commands
    else if (inputLower == "pot" || inputLower == "potentiometer") {
        useSerialAdjustment = false;
        Serial.println("Switched to POTENTIOMETER mode");
    }
    else if (inputLower == "auto" || inputLower == "ml") {
        serialAdjustment = 0.0;
        useSerialAdjustment = true;
        Serial.println("AUTO mode: Pure ML control (adjustment = 0%)");
    }
    else if (inputLower == "time") {
        int h, m, s;
        getCurrentTime(h, m, s);
        Serial.printf("Current time: %02d:%02d:%02d\n", h, m, s);
    }
    else if (inputLower == "status" || inputLower == "info") {
        int h, m, s;
        getCurrentTime(h, m, s);
        Serial.println("\n=== CURRENT STATUS ===");
        Serial.printf("Time:               %02d:%02d:%02d\n", h, m, s);
        Serial.printf("DT Prediction:      %.1f%%\n", lastDTPrediction);
        Serial.printf("Pot Adjustment:     %+.1f%%\n", lastPotAdjustment);
        Serial.printf("Serial Adjustment:  %+.1f%%\n", serialAdjustment);
        Serial.printf("Active Mode:        %s\n", useSerialAdjustment ? "SERIAL" : "POTENTIOMETER");
        Serial.printf("Final Brightness:   %.1f%%\n", currentBrightness);
        Serial.printf("Samples Collected:  %d / %d\n", sampleCount, LEARNING_SAMPLES);
        Serial.println("======================\n");
    }
    else if (inputLower == "help" || inputLower == "?") {
        printHelp();
    }
    else if (inputLower == "reset") {
        serialAdjustment = 0.0;
        useSerialAdjustment = true;
        Serial.println("Serial adjustment reset to 0%");
    }
    else {
        Serial.println("Unknown command. Type 'help' for commands.");
    }
}

void printHelp() {
    Serial.println("\n=== MANUAL CONTROL COMMANDS ===");
    Serial.println("Time Control:");
    Serial.println("  hh:mm:ss : Set time (e.g., 14:30:00 for 2:30 PM)");
    Serial.println("  time     : Show current time");
    Serial.println();
    Serial.println("Brightness Adjustment:");
    Serial.println("  +20      : Add +20% to DT prediction");
    Serial.println("  -15      : Subtract 15% from DT prediction");
    Serial.println("  0        : Use pure DT prediction (no adjustment)");
    Serial.println("  (Range: -50 to +50)");
    Serial.println();
    Serial.println("Mode Selection:");
    Serial.println("  pot      : Switch to potentiometer control");
    Serial.println("  auto     : Pure ML mode (no adjustment)");
    Serial.println("  reset    : Reset serial adjustment to 0%");
    Serial.println();
    Serial.println("Information:");
    Serial.println("  status   : Show current values");
    Serial.println("  help     : Show this help");
    Serial.println();
    Serial.println("Examples:");
    Serial.println("  Type '09:30:00' to set time to 9:30 AM");
    Serial.println("  Type '21:15:30' to set time to 9:15:30 PM");
    Serial.println("  Type '+10' to add 10% brightness");
    Serial.println("  Type 'pot' to use physical knob");
    Serial.println("================================\n");
}

// ============================================================================
// MAIN LOOP
// ============================================================================
void loop() {
    unsigned long currentTime = millis();
    
    // Check for serial input commands
    if (Serial.available()) {
        handleSerialInput();
    }

    if (currentTime - lastSampleTime >= SAMPLE_INTERVAL) {
        lastSampleTime = currentTime;

