imbeastbro272/Fin-Tracker/ESP32_SmartLight_Manual_Time.ino
        // Read sensors
        float lux    = readLux();
        int   motion = digitalRead(MOTION_PIN);

        int hour, minute, second;
        getCurrentTime(hour, minute, second);

        String timeOfDay = getTimeOfDay(hour);

        // Compute features
        float lux_norm       = lux / maxLux;
        if (lux_norm > 1.0f) lux_norm = 1.0f;
        if (lux_norm < 0.0f) lux_norm = 0.0f;
        float hour_sin       = sin(2.0 * PI * hour / 24.0);
        float hour_cos       = cos(2.0 * PI * hour / 24.0);
        int   time_enc       = getTimeEncoding(timeOfDay);
        float effective_need = (1.0 - lux_norm) * motion;

        // ML inference
        float dtBrightness = predictBrightness(lux_norm, motion, hour_sin,
                                               hour_cos, time_enc, effective_need);
        
        // Rule-based overrides
        if (lux > 2000.0f && motion == 1) {
            float cappedValue = 20.0f;
            if (dtBrightness > cappedValue) {
                Serial.printf("  [Override] Bright condition (%.0f lux) - capping %.1f%% -> %.1f%%\n", 
                              lux, dtBrightness, cappedValue);
                dtBrightness = cappedValue;
            }
        }
        if (lux > 5000.0f) {
            float cappedValue = 10.0f;
            if (dtBrightness > cappedValue) {
                Serial.printf("  [Override] Very bright (%.0f lux) - capping %.1f%% -> %.1f%%\n", 
                              lux, dtBrightness, cappedValue);
                dtBrightness = cappedValue;
            }
        }
        if (lux < 100.0f && motion == 0) {
            float cappedValue = 10.0f;
            if (dtBrightness > cappedValue) {
                Serial.printf("  [Override] Dark + no motion - capping %.1f%% -> %.1f%%\n", 
                              dtBrightness, cappedValue);
                dtBrightness = cappedValue;
            }
        }
        
        lastDTPrediction = dtBrightness;

        // Manual adjustment (potentiometer OR serial)
        float currentAdjustment;
        const char* adjustmentSource;
        
        if (useSerialAdjustment) {
            currentAdjustment = serialAdjustment;
            adjustmentSource = "Serial";
            lastPotAdjustment = currentAdjustment;
        } else {
            currentAdjustment = readPotAdjustment();
            lastPotAdjustment = currentAdjustment;
            adjustmentSource = "Pot";
        }

        // Final brightness
        float finalBrightness = dtBrightness + currentAdjustment;
        if (finalBrightness < 0.0f)   finalBrightness = 0.0f;
        if (finalBrightness > 100.0f) finalBrightness = 100.0f;
        currentBrightness = finalBrightness;

        setLEDBrightness(finalBrightness);

        Serial.printf("[%02d:%02d:%02d] Lux: %6.0f | Motion: %d | DT: %5.1f%% | %s: %+5.1f%% | Final: %5.1f%%\n",
                      hour, minute, second, lux, motion,
                      dtBrightness, adjustmentSource, currentAdjustment, finalBrightness);

        // Online learning trigger
        float adjustmentChange = fabs(currentAdjustment - previousPotAdjustment);
        
        if (adjustmentChange > ADJUSTMENT_THRESHOLD) {
            Serial.printf("  -> User adjustment CHANGED by %.1f%%. Collecting training sample...\n", adjustmentChange);

            if (sampleCount < MAX_SAMPLES) {
                DataSample& s = learningBuffer[sampleCount++];
                s.lux_norm          = lux_norm;
                s.motion_detected   = motion;
                s.hour_sin          = hour_sin;
                s.hour_cos          = hour_cos;
                s.time_of_day_enc   = time_enc;
                s.effective_need    = effective_need;
                s.target_brightness = finalBrightness;
                
                Serial.printf("     Sample %d/%d collected (target brightness: %.1f%%)\n", 
                             sampleCount, LEARNING_SAMPLES, finalBrightness);
            }

            if (sampleCount >= LEARNING_SAMPLES) {
                Serial.println();
                Serial.println("  ** Sufficient samples collected. Retraining model... **");
                retrainModel();
                saveLearningData();
                sampleCount = 0;
            }
            
            previousPotAdjustment = currentAdjustment;
        }
    }

    delay(100);
}

// ============================================================================
// SENSOR READING
// ============================================================================
float readLux() {
    const int SAMPLES = 20;
    long sum = 0;
    for (int i = 0; i < SAMPLES; i++) {
        sum += analogRead(LDR_PIN);
        delay(2);
    }
    int raw = sum / SAMPLES;
    
    if (raw <= 0) raw = 1;

    float voltage = (raw / 4095.0f) * 3.3f;
    if (voltage <= 0.01f) voltage = 0.01f;
    if (voltage >= 3.29f) voltage = 3.29f;

    const float R_FIXED = 10000.0f;
    const float V_CC = 3.3f;
    
    float r_ldr = R_FIXED * voltage / (V_CC - voltage);
    if (r_ldr <= 0.0f) r_ldr = 1.0f;

    const float LDR_A = 32768000.0f;
    const float LDR_B = -1.4f;
    
    float lux = LDR_A * pow(r_ldr, LDR_B);

    if (lux < 0.0f)    lux = 0.0f;
    if (lux > maxLux)  lux = maxLux;
    
    return lux;
}

float readPotAdjustment() {
    int raw = analogRead(POT_PIN);
    float adjustment = ((float)raw / 4095.0f) * 100.0f - 50.0f;
    return adjustment;
}

String getTimeOfDay(int hour) {
    if (hour >= 5  && hour < 8)  return "Early Morning";
    if (hour >= 8  && hour < 12) return "Morning";
    if (hour >= 12 && hour < 17) return "Afternoon";
    if (hour >= 17 && hour < 20) return "Evening";
    return "Night";
}

int getTimeEncoding(const String& timeOfDay) {
    if (timeOfDay == "Afternoon")     return 0;
    if (timeOfDay == "Early Morning") return 1;
    if (timeOfDay == "Evening")       return 2;
    if (timeOfDay == "Morning")       return 3;
    if (timeOfDay == "Night")         return 4;
    return 0;
}

// ============================================================================
// LED CONTROL
// ============================================================================
void setLEDBrightness(float percent) {
    if (percent < 0.0f)   percent = 0.0f;
    if (percent > 100.0f) percent = 100.0f;
    int pwmValue = (int)(percent * 255.0f / 100.0f);
    pwmWrite(LED_PWM_PIN, LED_CHANNEL, pwmValue);
}

// ============================================================================
// DECISION TREE INFERENCE
// ============================================================================
float predictBrightness(float lux_norm, int motion, float hour_sin,
                        float hour_cos, int time_enc, float effective_need) {
    if (treeRoot.isNull()) {
        return motion ? 70.0f : 0.0f;
    }

    float features[6] = {
        lux_norm,
        (float)motion,
        hour_sin,
        hour_cos,
        (float)time_enc,
        effective_need
    };

    JsonObject node = treeRoot;
    int safety = 0;

    while (node["type"] == "split" && safety++ < 100) {
        int   featureIdx = node["feature_idx"];
        float threshold  = node["threshold"];

        if (featureIdx < 0 || featureIdx >= 6) break;

        if (features[featureIdx] <= threshold) {
            node = node["left"].as<JsonObject>();
        } else {
            node = node["right"].as<JsonObject>();
        }
    }

    return node["value"];
}

// ============================================================================
// MODEL PERSISTENCE
// ============================================================================
bool loadModel() {
    File file = SPIFFS.open("/tree_model.json", "r");
    if (!file) {
        Serial.println("  X tree_model.json not found in SPIFFS");
        return false;
    }

    DeserializationError error = deserializeJson(treeDoc, file);
    file.close();

    if (error) {
        Serial.print("  X Failed to parse tree_model.json: ");
        Serial.println(error.c_str());
        return false;
    }

    treeRoot = treeDoc["tree"].as<JsonObject>();
    Serial.println("  + Decision tree loaded");
    Serial.printf("    - Features:  %d\n", (int)treeDoc["n_features"]);
    Serial.printf("    - Max Depth: %d\n", (int)treeDoc["max_depth"]);
    Serial.printf("    - Leaves:    %d\n", (int)treeDoc["n_leaves"]);

    file = SPIFFS.open("/preprocessing.json", "r");
    if (!file) {
        Serial.println("  X preprocessing.json not found");
        return false;
    }

    StaticJsonDocument<512> prepDoc;
    error = deserializeJson(prepDoc, file);
    file.close();

    if (error) {
        Serial.print("  X Failed to parse preprocessing.json: ");
        Serial.println(error.c_str());
        return false;
    }

    maxLux = prepDoc["max_lux"];
    Serial.printf("  + Preprocessing params loaded (max_lux: %.0f)\n", maxLux);

