imbeastbro272/Fin-Tracker/ESP32_SmartLight_Manual_Time.ino
    return true;
}

void saveLearningData() {
    File file = SPIFFS.open("/learning_data.bin", "w");
    if (!file) {
        Serial.println("  X Failed to open learning_data.bin for writing");
        return;
    }

    file.write((uint8_t*)&sampleCount, sizeof(int));
    file.write((uint8_t*)learningBuffer, sizeof(DataSample) * sampleCount);
    file.close();

    Serial.printf("  + Saved %d training samples\n", sampleCount);
}

void loadLearningData() {
    File file = SPIFFS.open("/learning_data.bin", "r");
    if (!file) {
        Serial.println("  ! No existing learning data found (fresh start)");
        sampleCount = 0;
        return;
    }

    file.read((uint8_t*)&sampleCount, sizeof(int));
    if (sampleCount > MAX_SAMPLES) sampleCount = MAX_SAMPLES;
    if (sampleCount < 0)           sampleCount = 0;
    file.read((uint8_t*)learningBuffer, sizeof(DataSample) * sampleCount);
    file.close();

    Serial.printf("  + Loaded %d existing training samples\n", sampleCount);
}

// ============================================================================
// ONLINE LEARNING
// ============================================================================
void retrainModel() {
    Serial.println();
    printSeparator('-', 80);
    Serial.println("RETRAINING MODEL WITH USER FEEDBACK");
    printSeparator('-', 80);

    const float learningRate = 0.1f;

    for (int i = 0; i < sampleCount; i++) {
        DataSample& sample = learningBuffer[i];

        float features[6] = {
            sample.lux_norm,
            (float)sample.motion_detected,
            sample.hour_sin,
            sample.hour_cos,
            (float)sample.time_of_day_enc,
            sample.effective_need
        };

        JsonObject node = treeRoot;
        int safety = 0;
        while (node["type"] == "split" && safety++ < 100) {
            int   featureIdx = node["feature_idx"];
            float threshold  = node["threshold"];

            if (featureIdx < 0 || featureIdx >= 6) break;

            if (features[featureIdx] <= threshold) {
                node = node["left"].as<JsonObject>();
            } else {
                node = node["right"].as<JsonObject>();
            }
        }

        float currentValue = node["value"];
        float newValue     = currentValue + learningRate * (sample.target_brightness - currentValue);
        node["value"]      = newValue;

        Serial.printf("  Sample %3d: leaf %5.1f%% -> %5.1f%%  (target %5.1f%%)\n",
                      i + 1, currentValue, newValue, sample.target_brightness);
    }

    File file = SPIFFS.open("/tree_model.json", "w");
    if (file) {
        serializeJson(treeDoc, file);
        file.close();
        Serial.println("  + Updated model saved to SPIFFS");
    } else {
        Serial.println("  X Failed to save updated model");
    }

    printSeparator('-', 80);
    Serial.println();
}
